dependencies/amrloadbalancing/run/fallingDrop/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01; //values here are in cm

vertices
(
    (-0.012 0   0)
    (-0.012 0.6 0)
    ( 0.012 0.6 0)
    ( 0.012 0   0)
    (-0.012 0   0.6)
    (-0.012 0.6 0.6)
    ( 0.012 0.6 0.6)
    ( 0.012 0   0.6)
);

blocks
(
    hex (0 3 2 1 4 7 6 5) (1 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (1 5 6 2)
            (6 5 4 7)
            (0 3 7 4)
        );
    }

    front
    {
      type empty;
      faces
      (
       (3 2 6 7)
      );
    }
    
    back
    {
      type empty;
      faces
      (
       (5 1 0 4)
      );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
